tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

brew "ag"
brew "go"
brew "nvm"

brew "htop"
brew "jq"
brew "starship"
brew "vim"
brew "nvim"
brew "zplug"
brew "zsh"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

if OS.mac?
  brew "iterm2"

  cask "1password"
  cask "docker"
  cask "fanny"
  cask "slack"
  cask "spectacle"
  cask "spotify"
  cask "visual-studio-code"

  cask "font-droid-sans-mono-for-powerline"
  cask "font-hack-nerd-font"
  cask "font-source-code-pro"
  cask "font-fira-code"
end
